<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [86]:
import pandas as pd # Подключим библиотеку Pandas
import psycopg2 # Подключим библиотеку для возмодности отправки SQL запросов на SQL сервер

In [87]:
# Параметры подключения для работы с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'Password cannot be published'
HOST = '84.201.134.129'
PORT = 5432

In [88]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
connection.close() # Закроем сессию т.к. далее во всех упражнениях она будет открываться заново

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [109]:

connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_3_1 = f'''
select 
'Vacancies' query, count(distinct id)
from public.vacancies
group by 1
'''
df = pd.read_sql_query(query_3_1, connection) # Отправим запрос на SQL сервер 
display(df) # Выведем результат на экран
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\3323956256.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection) # Отправим запрос на SQL сервер

       query  count
0  Vacancies  49197

In [90]:
# результат запроса
49197

49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [105]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_3_2 = f'''
select 
'employers' query, count(distinct id)
from public.employers
group by 1
'''
df = pd.read_sql_query(query_3_2, connection)# Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\1849186067.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

       query  count
0  employers  23501

In [92]:
23501

23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [108]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_3_3 = f'''
select 
'areas' query, count(distinct id) as count
from public.areas
group by 1
'''
df = pd.read_sql_query(query_3_3, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\2752496867.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection) # Отправим запрос на SQL сервер

   query  count
0  areas   1362

In [94]:
1362

1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [107]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_3_4 = f'''
select 
'industries' query, count(distinct industry_id) as count
from public.employers_industries
group by 1
'''
df = pd.read_sql_query(query_3_4, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\2412832939.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

        query  count
0  industries    294

In [96]:
294

294

***

# выводы по предварительному анализу данных
Данные в таблицах достаточно объемные. Количество требуемых вакансий превышает 49 тыс. Количество работодателей превышает 23 тыс. по почти 300 сферам деятельности. При этом количество представленных регионов более 1300. Из этого можно сделать вывод, что рынок IT специалистов востребован и не насыщен.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [ ]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_4_1 = f'''
select 
distinct a.name area, count(a.name) cnt
from public.vacancies v
JOIN public.areas a ON v.area_id = a.id
group by 1
order by 2 desc
limit 5
'''
df = pd.read_sql_query(query_4_1, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_20516\3360477365.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

In [ ]:
# результат запроса
	area	cnt
0	Москва	5333
1	Санкт-Петербург	2851
2	Минск	2112
3	Новосибирск	2006
4	Алматы	1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [110]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_4_2 = f'''
select 
'salary_count' salary_count, count(v.id) cnt
from public.vacancies v
where v.salary_from is not null or v.salary_to is not null
'''
df = pd.read_sql_query(query_4_2, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\3639733635.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection) # Отправим запрос на SQL сервер

   salary_count    cnt
0  salary_count  24073

In [ ]:
# результат запроса
24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [ ]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_4_3 = f'''
select 
'salary_avg' salary_avg, round(avg(v.salary_from)) salary_from, round(avg(v.salary_to)) salary_to
from public.vacancies v
'''
df = pd.read_sql_query(query_4_3, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_20516\1943094142.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   salary_avg  salary_from  salary_to
0  salary_avg      71065.0   110537.0

In [ ]:
# результат запроса
71065.0, 110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [ ]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_4_4 = f'''
select  
distinct v.schedule, v.employment, count(v.id)
from public.vacancies v
group by 1,2
order by 3 desc
'''
df = pd.read_sql_query(query_4_4, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_20516\725859913.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

In [ ]:

schedule	employment	count
0	Полный день	Полная занятость	35367
1	Удаленная работа	Полная занятость	7802
2	Гибкий график	Полная занятость	1593
3	Удаленная работа	Частичная занятость	1312
4	Сменный график	Полная занятость	940
5	Полный день	Стажировка	569
6	Вахтовый метод	Полная занятость	367
7	Полный день	Частичная занятость	347
8	Гибкий график	Частичная занятость	312
9	Полный день	Проектная работа	141
10	Удаленная работа	Проектная работа	133
11	Гибкий график	Стажировка	116
12	Сменный график	Частичная занятость	101
13	Удаленная работа	Стажировка	64
14	Гибкий график	Проектная работа	18
15	Сменный график	Стажировка	12
16	Вахтовый метод	Проектная работа	2
17	Сменный график	Проектная работа	1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [ ]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_4_5 = f'''
select  
distinct v.experience, count(v.id)
from public.vacancies v
group by 1
order by 2 asc
'''
df = pd.read_sql_query(query_4_5, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_20516\1895907044.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [ ]:
# результат запроса
	experience	count
0	Более 6 лет	1337
1	Нет опыта	7197
2	От 3 до 6 лет	14511
3	От 1 года до 3 лет	26152

Анализ таблиц показал, наибольшее количество вакансий представлено в Москве и Санкт-Петербурге. Учитывая то, что в таблице предсталено порядка 49 тыс. вакансий, почти у половины вакансий не указана верхняя и нижняя зартплатная вилка, т.е. работодатели скорее всего смогут назначить зарплату соискателю, только после прохождения собеседования. Средняя вилка зарплаты начинается от 71 тыс. и заканчивается 110 тыс. рублей. Также анализ показал, что наиболее востребованный график работы - полный рабочий день с полной занятостью, на втором месте стоит удаленная работа, также с полной занятостью. Кроме того, видно, что наиболее широко представлены вакансии для соискателей с опытом работы от 1 года до 3 лет, а наименее востребованные с опытом работы более 6 лет. С моей точки зрения, это связано с тем, что для соискателей с большим опытом работы необходимо платить достаточно большую зарплату, поэтому такие соискатели востребованы достаточно редко.

***

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [ ]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_5_1 = f'''
select 
distinct e.name, count(v.id)
from public.vacancies v
JOIN public.employers e ON v.employer_id = e.id
group by 1
order by 2 desc
limit 5
'''
df = pd.read_sql_query(query_5_1, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_20516\719410383.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

In [ ]:
	name	count
0	Яндекс	1933
1	Ростелеком	491
2	Тинькофф	444
3	СБЕР	428
4	Газпром нефть	331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [111]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_5_2 = f'''
select 
distinct a.name area_name, count(distinct e.name) employers, count(distinct v.id) vacancies
from public.areas a
left JOIN public.employers e ON a.id = e.area
left JOIN public.vacancies v ON  a.id = v.area_id
where v.id is null
group by 1
order by 2 desc
'''
df = pd.read_sql_query(query_5_2, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\297061534.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection) # Отправим запрос на SQL сервер

                        area_name  employers  vacancies
0                          Россия        410          0
1                       Казахстан        207          0
2              Московская область         75          0
3              Краснодарский край         19          0
4                        Беларусь         18          0
..                            ...        ...        ...
588                       Юрюзань          0          0
589    Ямбург (Ямало-Ненецкий АО)          0          0
590                       Янино-1          0          0
591  Ясный (Оренбургская область)          0          0
592                        Яшкино          0          0

[593 rows x 3 columns]

In [ ]:
# результат запроса
	area_name	employers	vacancies
0	Россия	410	0
1	Казахстан	207	0
2	Московская область	75	0
3	Краснодарский край	19	0
4	Беларусь	18	0
...	...	...	...
588	Юрюзань	0	0
589	Ямбург (Ямало-Ненецкий АО)	0	0
590	Янино-1	0	0
591	Ясный (Оренбургская область)	0	0
592	Яшкино	0	0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [112]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_5_3 = f'''
select  
e.name employers, count(distinct v.area_id) area_cnt
from public.employers e
JOIN  public.vacancies v  ON  e.id=v.employer_id
group by 1
order by 2 desc
'''
df = pd.read_sql_query(query_5_3, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\2715465449.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection) # Отправим запрос на SQL сервер

                    employers  area_cnt
0                      Яндекс       181
1                  Ростелеком       152
2                  Спецремонт       116
3      Поляков Денис Иванович        88
4                   ООО ЕФИН         71
...                       ...       ...
14761                  UniSol         1
14762            UNISTORY LLC         1
14763                   UNIT6         1
14764     United Distribution         1
14765              UNITEL LLC         1

[14766 rows x 2 columns]

In [ ]:
# результат запроса
181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [117]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_5_4 = f'''
select  
count(e.name) cnt
from public.employers e
left JOIN  public.employers_industries ei  ON  ei.employer_id=e.id
where ei.industry_id is null
'''
df = pd.read_sql_query(query_5_4, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\3094340738.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection) # Отправим запрос на SQL сервер

    cnt
0  8419

In [ ]:
# результат запроса
8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [119]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_5_5 = f'''
select  
e.name, count(distinct ei.industry_id)
from public.employers e
left JOIN  public.employers_industries ei  ON  ei.employer_id=e.id
group by 1
having count(distinct ei.industry_id)=4
order by 1 asc
limit 3
'''
df = pd.read_sql_query(query_5_5, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\2645809131.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection) # Отправим запрос на SQL сервер

           name  count
0  101 Интернет      4
1      21vek.by      4
2          2ГИС      4

In [ ]:
# результат запроса
2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [ ]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_5_6 = f'''
select  
count(e.name)
from public.employers_industries ei 
JOIN  public.employers e ON  ei.employer_id=e.id
JOIN  public.industries i  ON  i.id=ei.industry_id
where i.name = 'Разработка программного обеспечения'
'''
df = pd.read_sql_query(query_5_6, connection) # Отправим запрос на SQL сервер 
display(df.head(1000))
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_6304\3104500415.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   count
0   3553

In [ ]:
# результат запроса
3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [121]:
url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
tables = pd.read_html(url)
city_df = tables[1]
city_list = list(city_df['Город'])
city_list[13] = 'Воронеж'
city_list=tuple(city_list)
#print(city_list)
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_5_7 = f'''
(select
a.name,count(v.id) cnt
from public.vacancies v
join public.employers e on e.id = v.employer_id
join public.areas a on a.id = v.area_id
where e.name = 'Яндекс' and a.name in {city_list}     
group by a.name
order by 2 asc)
union all
(select
    'Total', count(v.id)
from public.vacancies v
join public.employers e on e.id = v.employer_id
join public.areas a on a.id = v.area_id
where e.name = 'Яндекс' and a.name in {city_list}
)
order by 2
'''
df = pd.read_sql_query(query_5_7, connection) # Отправим запрос на SQL сервер 
display(df.head(1000))
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\2106373576.py:34: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection) # Отправим запрос на SQL сервер

               name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4    Ростов-на-Дону   25
5             Пермь   25
6            Казань   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485

In [ ]:
# результат запроса
17,485

В таблице представлен достаточно широкий перечень работодателей из разных сфер деятельности. И конечно же первые места в этом списке занимают ИТ компании, что не удивительно. При этом вакансии Яндекс и Ростелеком присутстуют во всех горородах милионниках, что говорит о широком распространении по территории страны, либо это просто удаленная работа на дому. Интересным выводом стало то, что разработка ПО занимает менее 7% всех вакасий. По моему мнению, количество вакансий с разработкой ПО будет расти хорошими темпами.

***

In [ ]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [114]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_6_1 = f'''
select
count(*)
from public.vacancies v
where lower (v.name) like '%data%' or lower(v.name) like '%данн%' 
'''
df = pd.read_sql_query(query_6_1, connection) # Отправим запрос на SQL сервер 
display(df.head(1000))
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\3257855091.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection) # Отправим запрос на SQL сервер

   count
0   1771

In [ ]:
# результат запроса
1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [115]:
# текст запроса
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_6_2 = f'''
select
count(v.name)
from public.vacancies v
where (lower (v.name) LIKE '%data scientist%' 
	OR lower (v.name) LIKE '%data science%' 
 	OR lower (v.name) LIKE '%исследователь данных%' 
  	OR lower (v.name) LIKE '%machine learning%' 
    OR lower (v.name) LIKE '%машинн%обучен%'
    OR (v.name LIKE '%ML%' 
    AND v.name NOT LIKE '%HTML%')) 
    AND (
        lower (v.name) LIKE '%junior%'
        OR lower(v.experience) LIKE '%нет опыта%'
        OR lower(v.employment) LIKE '%стажировка%'
	) 
'''
df = pd.read_sql_query(query_6_2, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\529648266.py:26: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection) # Отправим запрос на SQL сервер

   count
0     51

In [ ]:
# результат запроса
51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [126]:
# текст запроса
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_6_3 = f'''
select
count(v.name)
from public.vacancies v
where 
( ( lower (v.name) LIKE '%data scientist%' 
	OR lower (v.name) LIKE '%data science%' 
 	OR lower (v.name) LIKE '%исследователь данных%' 
  OR lower (v.name) LIKE '%machine learning%' 
  OR lower (v.name) LIKE '%машинн%обучен%'
  OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))
  AND(lower(v.key_skills) like '%sql%' OR lower(v.key_skills) like '%postgres%')
)
'''
df = pd.read_sql_query(query_6_3, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\633047772.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection) # Отправим запрос на SQL сервер

   count
0    201

In [ ]:
# результат запроса
201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [123]:
# текст запроса
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_6_4 = f'''
select
count(v.name)
from public.vacancies v
where 
(( lower (v.name) LIKE '%data scientist%' 
	OR lower (v.name) LIKE '%data science%' 
 	OR lower (v.name) LIKE '%исследователь данных%' 
  OR lower (v.name) LIKE '%machine learning%' 
  OR lower (v.name) LIKE '%машинн%обучен%'
  OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))
  AND (lower(v.key_skills) like '%python%')
)
'''
df = pd.read_sql_query(query_6_4, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\3594474294.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection) # Отправим запрос на SQL сервер

   count
0    351

In [ ]:
# результат запроса
351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [ ]:
# текст запроса
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_6_5 = f'''
select
avg(length(v.key_skills)-length(replace(v.key_skills,chr(9),''))+1)
from public.vacancies v
where 
(( lower (v.name) LIKE '%data scientist%' 
	OR lower (v.name) LIKE '%data science%' 
 	OR lower (v.name) LIKE '%исследователь данных%' 
  OR lower (v.name) LIKE '%machine learning%' 
  OR lower (v.name) LIKE '%машинн%обучен%'
  OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))
)
'''
df = pd.read_sql_query(query_6_5, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\2558579923.py:16: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

        avg
0  6.406032

In [ ]:
# результат запроса
6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [116]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
) # Откроем сессию для отправки запроса на SQL сервер
query_6_6 = f'''
select
distinct(v.experience), ROUND(AVG((coalesce(salary_from, salary_to)+coalesce(salary_to, salary_from))/2))
from public.vacancies v
where 
(( lower (v.name) LIKE '%data scientist%' 
	OR lower (v.name) LIKE '%data science%' 
 	OR lower (v.name) LIKE '%исследователь данных%' 
  OR lower (v.name) LIKE '%machine learning%' 
  OR lower (v.name) LIKE '%машинн%обучен%'
  OR (v.name LIKE '%ML%' AND v.name NOT LIKE '%HTML%'))
  AND (v.salary_from is not null OR v.salary_to is not null)
)
group by 1  
'''
df = pd.read_sql_query(query_6_6, connection) # Отправим запрос на SQL сервер 
display(df)
connection.close() # Закроем сессию после запроса

C:\Users\khasi\AppData\Local\Temp\ipykernel_35376\3351240223.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection) # Отправим запрос на SQL сервер

           experience     round
0           Нет опыта   74643.0
1  От 1 года до 3 лет  139675.0
2       От 3 до 6 лет  243115.0


experience	round
0	Нет опыта	74643.0
1	От 1 года до 3 лет	139675.0
2	От 3 до 6 лет	243115.0

In [ ]:
# результат запроса
experience	round
0	Нет опыта	74643.0
1	От 1 года до 3 лет	139675.0
2	От 3 до 6 лет	243115.0

***

In [ ]:
# выводы по предметному анализу
Предметный анализ показал, что вакансий по исследованию данных еще достаточно мало, т.к. это развивающийся вид деятельности. 
При этом видно, что на рынке востребованы уже состоявшиеся датасаентисты.
Итересен тот факт, что вакансии на соискателей со знанием Python в 10 раз больше, чем соискателей датасаентистов со знанием Python,
а соискателей со знанием SQL в 50 раз больше. Кроме того, анализ показал, что датасаенс деятельность достаточно доходна,
и зарплата каждые три года увеличивается в два раза.

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
Выполнение проекта оказалось очень увлекательным занятием. Как я уже писал в выводах выше, 
общее количество вакансий так или иначе связанных с ИТ будет только расти. При этом будут также расти и зарплаты в этой области. 
Даже во время эпидемии Ковид-19, при общем падении количества предлагаемых вакансий, количество ИТ вакансий оставалось на прежднем уровне, 
а количества некоторых ИТ вакансии даже увеличилось. Прогнозно можно предположить, что количество вакансий связанных с машинным обучением 
будет удваиваться каждый год (при нормальных условиях). Для обшей оценки распротранения датасаенс и машшинного обучения в России по не ИТ отраслям,
было бы интересно провести исследование в таких отраслях как медицина, машиностроение, добыча полезных ископаемых и т.д., 
но для этого необходима таблица соотстветвия по ОКВЭД.